# FabricAreaType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricAreaType Class
Members See Also
---
A FabricAreaType object is used in FabricArea object generation.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class FabricAreaType : ElementType
```

Visual Basic
---
```text
Public Class FabricAreaType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class FabricAreaType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Structure..::..FabricAreaType
# See Also
FabricAreaType Members
Autodesk.Revit.DB.Structure Namespace